Revit 2024 API
UIFabricationUtils Members
The UIFabricationUtils type exposes the following members.
Methods
Name | Description
GetOpenConnectorIndicatorAwayColor
 Gets the color of the open connector indicator in away direction.
GetOpenConnectorIndicatorPlanColor
 Gets the color of the open connector indicator in plan view.
GetOpenConnectorIndicatorTowardsColor
 Gets the color of the open connector indicator in towards direction.
SetOpenConnectorIndicatorAwayColor
 Sets the color of the open connector indicator in away direction
SetOpenConnectorIndicatorPlanColor
 Sets the color of the open connector indicator in plan view.
SetOpenConnectorIndicatorTowardsColor
 Sets the color of the open connector indicator in towards direction
See Also
UIFabricationUtils Class
Autodesk.Revit.UI Namespace